# ResList_FilterNonAct

## Description
sets the filter for resource in the non-active open documents. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
PROCEDURE ResList_FilterNonAct(
				uniqueID : STRING;
				callback : PROCEDURE);
```

```python

def vs.ResList_FilterNonAct(uniqueID, callback):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING||
|callback|PROCEDURE||

## Version
Availability: from Vectorworks 2020
## Category
* Document List Handling